<template>
  <v-container fluid v-bind:class="{ 'pa-0': $vuetify.breakpoint.xsOnly }">
    <v-layout >
      <v-flex sm12>
        <h2 class="text-sm-center">FAQ</h2>
      </v-flex>
    </v-layout>
    <v-layout>
      <v-flex sm10 offset-sm1>
        <v-expansion-panel>
            <v-expansion-panel-content v-for="(item, index) in items" :key="item.q">
            <div slot="header">{{ item.q }}</div>
            <v-card>
                <v-card-text class="grey lighten-3">
                  {{ item.a }}
                  <a href="#" v-if="index == 8" @click.stop.prevent="dialog = true">вот здесь</a></v-card-text>
            </v-card>
            </v-expansion-panel-content>
        </v-expansion-panel>
        <v-dialog v-model="dialog" max-width="500px">
          <v-card>
            <v-toolbar style="flex: 0 0 auto;">
              <v-btn icon @click.native="dialog = false">
                <v-icon>close</v-icon>
              </v-btn>
            </v-toolbar>
            <v-card-text>
              <ol>
                <li v-for="(tip, index) in tips" :key="index" class="mb-2">{{ tip }}</li>
              </ol>
            </v-card-text>
        </v-card>
      </v-dialog>
      </v-flex>
    </v-layout>
  </v-container>
</template>

<script>
  export default {
    head () {
      return {
        title: 'FAQ',
      }
    },
    data() {
      return {
        dialog: false,
        items: [
          {
            q: '1. Когда будут готовы фотографии?',
            a: 'Срок готовности фотографии 3-4 недели, зависит от загруженности, от выбранного пакета услуг. Если фотографии будут готовы раньше, я обязательно вам сообщу об этом и отправлю.',
          },
          {
            q: '2. Отдаете ли вы исходники?',
            a: 'Только в пакете минимальный как бонус, в остальных я отдаю ретушь и цветокоррекцию в формате jpeg.',
          },
          {
            q: '3. Как можно забрать фотографии?',
            a: '',
          },
          {
            q: '4. Кто отбирает фотографии для ретуши?',
            a: 'Фотографии я отбираю сама. Но вы всегда сможете заказать дополнительную ретушь фото из папки цветокоррекция.',
          },
          {
            q: '5. Предоставляете ли вы одежду для съемок?',
            a: 'Нет, но я всегда готова помочь в подготовке образа (ваши вещи, либо аренда) ну или что-то придумаем вместе с вами)',
          },
          {
            q: '6. Нужно ли нам встречаться перед съемкой?',
            a: 'Как правило в этом нет необходимости, все вопросы можно решить по телефону или переписке. Но если какие-то индивидуальные случаи, то я в вашем расположении',
          },
          {
            q: '7. Мы не умеем позировать. Вы нам поможете?',
            a: 'Конечно я помогу. Но дело не только в позе и в натянутых улыбках, а в том, что вы должны быть максимально расслаблены и естественны. Я буду вас направлять и подсказывать, но от вас тоже потребуется инициатива. Если это фотосъемка с ребенком, то можно с ним играть, целовать, обнимать, щекотать, все то, что вы делаете дома, чтобы его рассмешить и привести в хорошее настроение. А я буду «ловить моменты». Ведь самые лучше кадры — естественные, живые. Но классические позы тоже будут). Если love-story, то проявляйте любовь и заботу по отношению ко второй половинке.',
          },
          {
            q: '8. Вы предоставляете аксессуары для съемки?',
            a: 'Нет, так как каждый клиент, будь то пара, ребенок или семья индивидуальны. И у нас индивидуальная фотосессия, а не фотопроект. И у каждого свои вкусы и интересы. У каждого ребенка своя любимая игрушка, и мне нет смысла привозить на каждую съемку одного и того же мишку) Будет здорово, если вы сами знаете, что хотите, либо мы вместе с вами придумаем и подберем аксессуары именно для вас!',
          },
          {
            q: '9. Что одеть на фотосессию? Нужно ли готовиться?',
            a: 'Конечно, подготовка к фотосесии очень важна. От нее зависит 50% успеха. Помощь по подбору одежды можете почитать',
          },
        ],
        tips: [
          'Желательно, чтобы одежда для всей семьи была в едином стиле и гармонировала между собой. Согласитесь, будет странно, если мама и ребенок будут в свитерах, а папа в майке, или девушка -в вечернем платье, а молодой человек в джинсах и футболке',
          'Одежда должна сочетаться между собой по цветам. Стилисты рекомендуют не использовать более 3х основных цветов',
          'Практически всегда выигрышно смотрится одежда однотонных пастельных цветов. Но все зависит от',
          'Одежда должна сочетаться с выбранной студией (декорациями',
          'Одежда должна быть удобной',
        ],
      }
    },
  }
</script>
