<template>
  <v-container fluid>
    <v-layout row>
      <v-flex sm12>
        <h2 class="text-sm-center" v-text="title"></h2>
      </v-flex>
    </v-layout>
    <v-layout row>
      <v-flex xs12 sm6 offset-sm3>
        <p>Совсем скоро наступит долгожданное для всех детей время года — зима. А где зима, там и Новый Год.</p>
        <p>Новогодняя съемка давно стала традицией во многих семьях. Она объединяет, дарит праздничное настроение и оставляет после себя память на всю жизнь в виде фотографий.</p>

        <v-card>
          <v-card-title primary-title>
            <div class="headline">Хотелось бы дать несколько советов о том как подготовиться к новогдней фотосессии:</div>
          </v-card-title>
          <template v-for="item in items">
            <v-layout align-center row class="ma-1">
              <v-flex xs2 class="text-xs-center">
                <v-avatar size="36px">
                  <v-icon class="blue-grey--text text--darken-2">star</v-icon>
                </v-avatar>
              </v-flex>
              <v-flex xs10>
                <strong>{{item.subheader}}</strong>
                <div>{{item.text}}</div>
              </v-flex>
            </v-layout>
            <v-divider></v-divider>
          </template>
        </v-card>
        <br>
      </v-flex>
    </v-layout>
  </v-container>
</template>

<script>
  const title = 'Новогодняя фотосессия';
  export default {
    head () {
      return {
        title,
      }
    },
    data() {
      return {
        title,
        items: [
          {
            subheader: 'Выбор места для съемки',
            text: 'Съемка должна быть близка вам по духу и если вы не любите студии, не насилуйте себя, есть и другие варианты, например, домашняя съемка, либо это может быть уличная.',
          },
          {
            subheader: 'У вас есть домашние животные???',
            text: 'Прекрасно, берите их с собой) Только не забудьте предупредить об этом заранее.',
          },
          {
            subheader: 'Подумайте об одежде заранее',
            text: 'Конечно никто вас не может заставить прийти в чем-то конкретном, но прислушавшись к паре советов по подборе образов - результат фотосесии будет гораздо лучше. Здесь вы можете посмотреть рекомендации по подбору образов, цветов для вашей фотосесии.',
          },
          {
            subheader: 'Не забывайте улыбаться, веселиться и получать удовольствие',
            text: 'Фотосессия получится более удачной, волшебной, если и у вас самих будет праздничное настроение.',
          },
          {
            subheader: 'Если фотосессия с ребенком',
            text: 'не обязательно его постоянно одергивать, чтобы он стоял по стойке смирно, смотрел на незнакомую «тетю» и улыбался в камеру. Нервничаете вы — нервничает ребенок, и не забываем о том, что фотосессия с детьми это совместная работа фотографа и родителей. Ведь только вы знаете как рассмешить ребенка или успокоить)',
          },
        ],
      }
    },
  }
</script>
